#include "C5515.h"

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *  EVM5515_wait( delay )                                                   *
 *                                                                          *
 *      Программная задержка                               					*
 *                                                                          *
 * ------------------------------------------------------------------------ */
void c5515_wait( Uint32 delay )
{
    volatile Uint32 i;
    for ( i = 0 ; i < delay ; i++ ){ };
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *  _waitusec( usec )                                                       *
 *                                                                          *
 *      Программная задержка в 'x' микросекунд                              *
 *                                                                          *
 * ------------------------------------------------------------------------ */
void c5515_waitusec( Uint32 usec )
{
    c5515_wait( (Uint32)usec * 8 );
}

/* ------------------------------------------------------------------------ *
 *                                                                          *
 *  EVM5515_init( )                                                         *
 *                                                                          *
 *      Инициализация микропроцессора                                       *
 *                                                                          *
 * ------------------------------------------------------------------------ */
Int16 c5515_init( )
{
    /* Enable clocks to all peripherals */
    SYS_PCGCR1 = 0x0000;
    SYS_PCGCR2 = 0x0000;
	
    return 0;
}
